---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures.SymtemColorFillLegendNotAllowed
source: html/e557b7db-b552-96f3-66c8-9d358c1ccb87.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures.SymtemColorFillLegendNotAllowed Property

[Category name] Color Fill Legend can only be placed in a Floor Plan View.

## Syntax (C#)
```csharp
public static FailureDefinitionId SymtemColorFillLegendNotAllowed { get; }
```